Revit 2027 API
ExternalDataManagerCommand.Id Property
 The id of the command.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerCommandId Id { get; set; }
Public Property Id As ExternalDataManagerCommandId
	Get
	Set
public:
property ExternalDataManagerCommandId^ Id {
	ExternalDataManagerCommandId^ get ();
	void set (ExternalDataManagerCommandId^ value);
}
member Id : ExternalDataManagerCommandId with get, set
Property Value
ExternalDataManagerCommandId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalDataManagerCommand Class
Autodesk.Revit.UI Namespace